; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-15)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room4)
(at ball11 room5)
(at ball12 room5)
(at ball13 room5)
(at ball14 room6)
(at ball15 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room4)
(at ball11 room5)
(at ball12 room5)
(at ball13 room6)
(at ball14 room6)
(at ball15 room6)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 15
2. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 13 of 15
3. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 13 of 15
4. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 13 of 15
5. (pick ball13 room5 right)
   deleted: (at ball13 room5) (free right)
   added: (carry ball13 right)
   goals met: 13 of 15
6. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 13 of 15
7. (drop ball13 room6 right)
   deleted: (carry ball13 right)
   added: (at ball13 room6) (free right)
   goals met: 14 of 15
8. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 14 of 15
9. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 15 of 15
